Fontes/Ecalc/fontes/017 - Pedido de Venda/eai.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tot="http://www.totvs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <tot:RECEIVEMESSAGE>
         <tot:INMSG><![CDATA[ 

<TOTVSIntegrator>
	<GlobalProduct>TOTVS|EAI</GlobalProduct>
	<GlobalFunctionCode>EAI</GlobalFunctionCode>
	<GlobalDocumentFunctionCode>IOMTA410</GlobalDocumentFunctionCode>
	<GlobalDocumentFunctionDescription>Pedido de Venda</GlobalDocumentFunctionDescription>
	<DocVersion>1.000</DocVersion>
	<DocDateTime>2017-05-05T00:00:00Z</DocDateTime>
	<DocIdentifier>
	
	82CD8CB5-C030-4412-8406-87588CF57A25
	
	</DocIdentifier>
	<DocCompany>99</DocCompany>
	<DocBranch>01</DocBranch>
	<DocName />
	<DocFederalID />
	<DocType>1</DocType>
	<Message>
		<Layouts>
			<Version>1.000</Version>
			<Identifier>
			
			82CD8CB5-C030-4412-8406-87588CF57A25
			
			</Identifier>
			<FunctionCode>U_IOMTA410</FunctionCode>
			<Content>
				<MATA410_MODEL>
					<SC5_FIELD_MASTER>
						<C5_NUM>
							<value>000008</value>
						</C5_NUM>
						<C5_TIPO>
							<value>N</value>
						</C5_TIPO>
						<C5_CLIENTE>
							<value>C001</value>
						</C5_CLIENTE>
						<C5_LOJACLI>
							<value>00</value>
						</C5_LOJACLI>
						<C5_TIPOCLI>
							<value>F</value>
						</C5_TIPOCLI>
						<C5_CONDPAG>
							<value>30D</value>
						</C5_CONDPAG>
						<SC6_GRID_MASTER>
							<items>
								<item>
									<C6_ITEM>001</C6_ITEM>
									<C6_PRODUTO>P001</C6_PRODUTO>
									<C6_QTDVEN>10.5</C6_QTDVEN>
									<C6_PRCVEN>15.7</C6_PRCVEN>
									<C6_TES>512</C6_TES>
								</item>
								<item>
									<C6_ITEM>002</C6_ITEM>
									<C6_PRODUTO>P001</C6_PRODUTO>
									<C6_QTDVEN>10</C6_QTDVEN>
									<C6_PRCVEN>15</C6_PRCVEN>
									<C6_TES>512</C6_TES>
								</item>
							</items>
						</SC6_GRID_MASTER>
					</SC5_FIELD_MASTER>
				</MATA410_MODEL>
			</Content>
		</Layouts>
	</Message>
</TOTVSIntegrator>
   
         ]]></tot:INMSG>
      </tot:RECEIVEMESSAGE>
   </soapenv:Body>
</soapenv:Envelope>