Fontes/Ecalc/fontes/017 - Pedido de Venda/erro.log

--------------------------------------------------------------------------------
FTJOBPVCF(000008): Cash flow for sales order
--------------------------------------------------------------------------------
ok

[ERROR][SERVER] [THROW][Thread 6940] tConnnErrorException (8:Erro de comunicacao: Erro de sincronismo) on D:\bamboo-agent-5.7.2\xml-data\build-dir\TP11-BUILDV2APPSRV-TEC11WIN32RPO32\advtec9_tt11\lib_comm\msgmanager.cpp:415

[INFO ][SERVER] [Thread 6940] [09/05/2017 15:30:46] Debugger finished (elton.alves, SPON4944)

ADVPL WSDL Server 1.110216  FATAL ERROR 
-------------------------------------------------------------------------------
Environment .........: ENVIRONMENT
Date / Time .........: 20170509 15:30:48
Web Service .........: EAISERVICE
Action / Method .....: RECEIVEMESSAGE
Client Information ..: Apache-HttpClient/4.1.1  (java 1.5; ; )
Description .........: 

THREAD ERROR ([7032], JOB_WS, THIS)   09/05/2017 15:30:48
SC6990: DB error (Update): -29 File: SC6990 - Error : 515 (23000) (RC=-1) - [Microsoft][ODBC SQL Server Driver][SQL Server]Não é possível inserir o valor NULL na coluna 'C6_SEGUM', tabela 'P12.dbo.SC6990'; a coluna não permite nulos. Falha em UPDATE. ( From tISAMFile::Update )
Thread ID [6608]	User [Administrador]	IO [10969]	Tables [109]	MaxTables [109]	Comment [[JOB_WS] WSServer SOAP REQUEST (EAISERVICE:RECEIVEMESSAGE) em 20170509 15:30:06  (running)]	Status []	SP [ ]	Traced [No]	SQLReplay [No]	InTran [Yes]	DBEnv [MSSQL/P12_MSSQL]	DBThread [(SPID 56)]	Started [09/05/2017 15:30:06]	LastIO [09/05/2017 15:30:48]	IP [192.168.56.1:7012]	RCV [565013]	SND [1343129]	TCBuild [20161016-20170331]	
UPDATE dbo.SC6990 SET C6_QTDVEN = ?,C6_PRCVEN = ?,C6_VALOR = ?,C6_SEGUM = ?,C6_LA = ?,C6_NOTA = ?,C6_SERIE = ?,C6_DATFAT = ?,C6_PEDCLI = ?,C6_BLOQUEI = ?,C6_RESERVA = ?,C6_OP = ?,C6_OK = ?,C6_NFORI = ?,C6_ITEMORI = ?,C6_IDENTB6 = ?,C6_BLQ = ?,C6_CODISS = ?,C6_GRADE = ?,C6_ITEMGRD = ?,C6_LOTECTL = ?,C6_NUMLOTE = ?,C6_DTVALID = ?,C6_NUMORC = ?,C6_CHASSI = ?,C6_OPC = ?,C6_LOCALIZ = ?,C6_NUMSERI = ?,C6_NUMOP = ?,C6_ITEMOP = ?,C6_CLASFIS = ?,C6_CONTRAT = ?,C6_NUMOS = ?,C6_NUMOSFA = ?,C6_CODFAB = ?,C6_LOJAFA = ?,C6_ITEMCON = ?,C6_REVISAO = ?,C6_SERVIC = ?,C6_ENDPAD = ?,C6_TPESTR = ?,C6_CONTRT = ?,C6_TPCONTR = ?,C6_ITCONTR = ?,C6_GEROUPV = ?,C6_PROJPMS = ?,C6_EDTPMS = ?,C6_TASKPMS = ?,C6_TRT = ?,C6_PROJET = ?,C6_ITPROJ = ?,C6_LICITA = ?,C6_REGWMS = ?,C6_NUMCP = ?,C6_NUMSC = ?,C6_ITEMSC = ?,C6_ITEMED = ?,C6_CODROM = ?,C6_PROGRAM = ?,C6_TURNO = ?,C6_FCICOD = ?,C6_CODLAN = ?,C6_FORDED = ?,C6_LOJDED = ?,C6_PVCOMOP = ?,C6_VDMOST = ?,C6_ITEMGAR = ?,C6_ORCGAR = ?,C6_TNATREC = ?,C6_HORENT = ?,C6_ITEMPC = ?,C6_NUMPCOM = ?,C6_ALMTERC = ?,C6_CCUSTO = ?,C6_SOLCOM = ?,C6_FILPED = ?,C6_ITPC = ?,C6_PEDCOM = ?,C6_CC = ?,C6_CONTA = ?,C6_ITEMCTA = ?,C6_CLVL = ?,C6_GCPIT = ?,C6_GCPLT = ?,C6_PMSID = ?,C6_NFDED = ?,C6_TPDEDUZ = ?,C6_MOTDED = ?,C6_SERDED = ?,C6_CODLPRE = ?,C6_D1ITEM = ?,C6_ITLPRE = ?,C6_D1DOC = ?,C6_CODINF = ?,C6_PRODFIN = ?,C6_REVPROD = ?,C6_PEDVINC = ?,C6_CNATREC = ?,C6_GRPNATR = ?,C on DISARMTRANSACTION(APLIB060.PRW) 03/03/2017 17:45:13 line : 1477

[TOTVS build: 7.00.131227A-20170412 NG]
Called from DISARMTRANSACTION(APLIB060.PRW) 03/03/2017 17:45:13 line : 1477
Called from FWEXECEAI(FWEAIUTIL.PRW) 10/02/2017 11:08:31 line : 570
Called from FWEAI:SAVE(FWEAI.PRW) 10/02/2017 11:05:47 line : 1261
Called from EAISERVICE:RECEIVEMESSAGE(EAISERVICE.PRW) 06/10/2016 15:55:57 line : 135
Called from WSEXECUTE(XMLWSVCS.PRW) 29/03/2017 15:10:25 line : 1999
Called from __WSCONNECT(XMLWSVCS.PRW) 29/03/2017 15:10:25 line : 1102
Called from STATICCALL(XMLWSVCS.PRW) 29/03/2017 15:10:25 line : 1102

-------------------------------------------------------------------------------

------------------------- XMLWSVCCONNECT INFORMATION --------------------------
aHeaders           -> ARRAY (      8) [...]
     aHeaders          [1] -> C (     32) [POST /ws/EAISERVICE.apw HTTP/1.1]
     aHeaders          [2] -> C (     29) [Accept-Encoding: gzip,deflate]
     aHeaders          [3] -> C (     36) [Content-Type: text/xml;charset=UTF-8]
     aHeaders          [4] -> C (     49) [SOAPAction: "http://www.totvs.com/RECEIVEMESSAGE"]
     aHeaders          [5] -> C (     20) [Content-Length: 2038]
     aHeaders          [6] -> C (     19) [Host: spon4944:7112]
     aHeaders          [7] -> C (     22) [Connection: Keep-Alive]
     aHeaders          [8] -> C (     46) [User-Agent: Apache-HttpClient/4.1.1 (java 1.5)]
httpCookies        -> ARRAY (      0) [...]
httpPost           -> ARRAY (      0) [...]
httpGet            -> ARRAY (      0) [...]
HttpRCtType()      -> C (     22) [text/xml;charset=utf-8]
HttpRCtLen()       -> N (     15) [      2038.0000]
HttpRCtDisp()      -> C (      0) []
SoapRAction()      -> C (     37) ["http://www.totvs.com/RECEIVEMESSAGE"]
HttpOtherContent() -> C (   2038) [<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tot="http://www.totvs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <tot:RECEIVEMESSAGE>
         <tot:INMSG><![CDATA[ 

<TOTVSIntegrator>
	<GlobalProduct>TOTVS|EAI</GlobalProduct>
	<GlobalFunctionCode>EAI</GlobalFunctionCode>
	<GlobalDocumentFunctionCode>IOMTA410</GlobalDocumentFunctionCode>
	<GlobalDocumentFunctionDescription>Pedido de Venda</GlobalDocumentFunctionDescription>
	<DocVersion>1.000</DocVersion>
	<DocDateTime>2017-05-05T00:00:00Z</DocDateTime>
	<DocIdentifier>
	
	82CD8CB5-C030-4412-8406-87588CF57A25
	
	</DocIdentifier>
	<DocCompany>99</DocCompany>
	<DocBranch>01</DocBranch>
	<DocName />
	<DocFederalID />
	<DocType>1</DocType>
	<Message>
		<Layouts>
			<Version>1.000</Version>
			<Identifier>
			
			82CD8CB5-C030-4412-8406-87588CF57A25
			
			</Identifier>
			<FunctionCode>U_IOMTA410</FunctionCode>
			<Content>
				<MATA410_MODEL>
					<SC5_FIELD_MASTER>
						<C5_NUM>
							<value>000008</value>
						</C5_NUM>
						<C5_TIPO>
							<value>N</value>
						</C5_TIPO>
						<C5_CLIENTE>
							<value>C001</value>
						</C5_CLIENTE>
						<C5_LOJACLI>
							<value>00</value>
						</C5_LOJACLI>
						<C5_TIPOCLI>
							<value>F</value>
						</C5_TIPOCLI>
						<C5_CONDPAG>
							<value>30D</value>
						</C5_CONDPAG>
						<SC6_GRID_MASTER>
							<items>
								<item>
									<C6_ITEM>001</C6_ITEM>
									<C6_PRODUTO>P001</C6_PRODUTO>
									<C6_QTDVEN>10.5</C6_QTDVEN>
									<C6_PRCVEN>15.7</C6_PRCVEN>
									<C6_TES>512</C6_TES>
								</item>
								<item>
									<C6_ITEM>002</C6_ITEM>
									<C6_PRODUTO>P001</C6_PRODUTO>
									<C6_QTDVEN>10</C6_QTDVEN>
									<C6_PRCVEN>15</C6_PRCVEN>
									<C6_TES>512</C6_TES>
								</item>
							</items>
						</SC6_GRID_MASTER>
					</SC5_FIELD_MASTER>
				</MATA410_MODEL>
			</Content>
		</Layouts>
	</Message>
</TOTVSIntegrator>
   
         ]]></tot:INMSG>
      </tot:RECEIVEMESSAGE>
   </soapenv:Body>
</soapenv:Envelope>]
-------------------------------------------------------------------------------
